In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("C:\\Users\\usman\\Documents\\hhhhhhh.csv")

In [9]:
(df)

     name  roll
0   usman    12
1     ali    14
2   usman    12
3  panjab    12
4  panjab    13
5   usman    15
6     ali   144
7    raza   333
8   sumro   444

In [5]:
dd=df.drop_duplicates()

In [7]:
len(dd)

8

In [23]:
gg=df.drop_duplicates(subset=["name"],keep="first",)

In [24]:
gg

     name  roll
0   usman    12
1     ali    14
3  panjab    12
7    raza   333
8   sumro   444